ws-client/C++/GSNWebServiceSoap12Binding.unregisterQuery.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
 xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns3="http://datarequest.http.gsn/xsd"
 xmlns:ns2="http://standard.webservice.gsn/xsd"
 xmlns:ns4="http://standard.webservice.gsn/GSNWebServiceSoap12Binding"
 xmlns:ns1="http://standard.webservice.gsn"
 xmlns:ns5="http://standard.webservice.gsn/GSNWebServiceSoap11Binding">
 <SOAP-ENV:Body>
   <ns1:unregisterQuery>
    <ns1:acDetails>
     <ns2:username></ns2:username>
     <ns2:password></ns2:password>
    </ns1:acDetails>
    <ns1:queryName></ns1:queryName>
   </ns1:unregisterQuery>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
